MikroElektronika/core_packages/RX/gcc/def/renesas/R5F572MNHDFP/mcu.h
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char EVENTPOS : 1;
			unsigned char EVENTNEG : 1;
			unsigned char PINSTATE : 1;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char PINSTATE : 1;
			unsigned char EVENTNEG : 1;
			unsigned char EVENTPOS : 1;
#endif
	} BIT;
	} DCLATCH0STAT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char EVENTPOS : 1;
			unsigned char EVENTNEG : 1;
			unsigned char PINSTATE : 1;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char PINSTATE : 1;
			unsigned char EVENTNEG : 1;
			unsigned char EVENTPOS : 1;
#endif
	} BIT;
	} DCLATCH1STAT;
	unsigned long long DCLATCH0TIMEPOS;
	unsigned long long DCLATCH0TIMENEG;
	unsigned long long DCLATCH1TIMEPOS;
	unsigned long long DCLATCH1TIMENEG;
	char           wk43[32];
	unsigned long  DCECATCHGTIME;
	char           wk44[4];
	unsigned long  DCPDISTARTTIME;
	unsigned long  DCPDICHGTIME;
	char           wk45[1024];
	unsigned long long PRODUCTID;
	unsigned long long VENDORID;
	char           wk46[368];
	union {
		unsigned long LDATA[32];
		unsigned short WDATA[64];
		unsigned char BDATA[128];
	} USERRAM;
	union {
		unsigned long LDATA[2048];
		unsigned short WDATA[4096];
		unsigned char BDATA[8192];
	} DATARAM;
} st_esc_t;

typedef struct st_etherc {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PRM : 1;
			unsigned long DM : 1;
			unsigned long RTM : 1;
			unsigned long ILB : 1;
			unsigned long  : 1;
			unsigned long TE : 1;
			unsigned long RE : 1;
			unsigned long  : 2;
			unsigned long MPDE : 1;
			unsigned long  : 2;
			unsigned long PRCEF : 1;
			unsigned long  : 3;
			unsigned long TXF : 1;
			unsigned long RXF : 1;
			unsigned long PFR : 1;
			unsigned long ZPF : 1;
			unsigned long TPC : 1;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long TPC : 1;
			unsigned long ZPF : 1;
			unsigned long PFR : 1;
			unsigned long RXF : 1;
			unsigned long TXF : 1;
			unsigned long  : 3;
			unsigned long PRCEF : 1;
			unsigned long  : 2;
			unsigned long MPDE : 1;
			unsigned long  : 2;
			unsigned long RE : 1;
			unsigned long TE : 1;
			unsigned long  : 1;
			unsigned long ILB : 1;
			unsigned long RTM : 1;
			unsigned long DM : 1;
			unsigned long PRM : 1;
#endif
	} BIT;
	} ECMR;
	char           wk0[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RFL : 12;
			unsigned long  : 20;
#else
			unsigned long  : 20;
			unsigned long RFL : 12;
#endif
	} BIT;
	} RFLR;
	char           wk1[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ICD : 1;
			unsigned long MPD : 1;
			unsigned long LCHNG : 1;
			unsigned long  : 1;
			unsigned long PSRTO : 1;
			unsigned long BFR : 1;
			unsigned long  : 26;
#else
			unsigned long  : 26;
			unsigned long BFR : 1;
			unsigned long PSRTO : 1;
			unsigned long  : 1;
			unsigned long LCHNG : 1;
			unsigned long MPD : 1;
			unsigned long ICD : 1;
#endif
	} BIT;
	} ECSR;
	char           wk2[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ICDIP : 1;
			unsigned long MPDIP : 1;
			unsigned long LCHNGIP : 1;
			unsigned long  : 1;
			unsigned long PSRTOIP : 1;
			unsigned long BFSIPR : 1;
			unsigned long  : 26;
#else
			unsigned long  : 26;
			unsigned long BFSIPR : 1;
			unsigned long PSRTOIP : 1;
			unsigned long  : 1;
			unsigned long LCHNGIP : 1;
			unsigned long MPDIP : 1;
			unsigned long ICDIP : 1;
#endif
	} BIT;
	} ECSIPR;
	char           wk3[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MDC : 1;
			unsigned long MMD : 1;
			unsigned long MDO : 1;
			unsigned long MDI : 1;
			unsigned long  : 28;
#else
			unsigned long  : 28;
			unsigned long MDI : 1;
			unsigned long MDO : 1;
			unsigned long MMD : 1;
			unsigned long MDC : 1;
#endif
	} BIT;
	} PIR;
	char           wk4[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long LMON : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long LMON : 1;
#endif
	} BIT;
	} PSR;
	char           wk5[20];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RMD : 20;
			unsigned long  : 12;
#else
			unsigned long  : 12;
			unsigned long RMD : 20;
#endif
	} BIT;
	} RDMLR;
	char           wk6[12];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long IPG : 5;
			unsigned long  : 27;
#else
			unsigned long  : 27;
			unsigned long IPG : 5;
#endif
	} BIT;
	} IPGR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long AP : 16;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long AP : 16;
#endif
	} BIT;
	} APR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MP : 16;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long MP : 16;
#endif
	} BIT;
	} MPR;
	char           wk7[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RPAUSE : 8;
			unsigned long  : 24;
#else
			unsigned long  : 24;
			unsigned long RPAUSE : 8;
#endif
	} BIT;
	} RFCF;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TPAUSE : 16;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long TPAUSE : 16;
#endif
	} BIT;
	} TPAUSER;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TXP : 8;
			unsigned long  : 24;
#else
			unsigned long  : 24;
			unsigned long TXP : 8;
#endif
	} BIT;
	} TPAUSECR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long BCF : 16;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long BCF : 16;
#endif
	} BIT;
	} BCFRR;
	char           wk8[80];
	unsigned long  MAHR;
	char           wk9[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MA : 16;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long MA : 16;
#endif
	} BIT;
	} MALR;
	char           wk10[4];
	unsigned long  TROCR;
	unsigned long  CDCR;
	unsigned long  LCCR;
	unsigned long  CNDCR;
	char           wk11[4];
	unsigned long  CEFCR;
	unsigned long  FRECR;
	unsigned long  TSFRCR;
	unsigned long  TLFRCR;
	unsigned long  RFCR;
	unsigned long  MAFCR;
} st_etherc_t;

typedef struct st_exdmac {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DMST : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char DMST : 1;
#endif
	} BIT;
	} EDMAST;
	char           wk0[479];
	unsigned long  CLSBR0;
	unsigned long  CLSBR1;
	unsigned long  CLSBR2;
	unsigned long  CLSBR3;
	unsigned long  CLSBR4;
	unsigned long  CLSBR5;
	unsigned long  CLSBR6;
	unsigned long  CLSBR7;
} st_exdmac_t;

typedef struct st_exdmac0 {
	void          *EDMSAR;
	void          *EDMDAR;
	unsigned long  EDMCRA;
	unsigned short EDMCRB;
	char           wk0[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short DCTG : 2;
			unsigned short  : 6;
			unsigned short SZ : 2;
			unsigned short  : 2;
			unsigned short DTS : 2;
			unsigned short MD : 2;
#else
			unsigned short MD : 2;
			unsigned short DTS : 2;
			unsigned short  : 2;
			unsigned short SZ : 2;
			unsigned short  : 6;
			unsigned short DCTG : 2;
#endif
	} BIT;
	} EDMTMD;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DACKSEL : 1;
			unsigned char DACKW : 1;
			unsigned char DACKE : 1;
			unsigned char DACKS : 1;
			unsigned char  : 4;
#else
			unsigned char  : 4;
			unsigned char DACKS : 1;
			unsigned char DACKE : 1;
			unsigned char DACKW : 1;
			unsigned char DACKSEL : 1;
#endif
	} BIT;
	} EDMOMD;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DARIE : 1;
			unsigned char SARIE : 1;
			unsigned char RPTIE : 1;
			unsigned char ESIE : 1;
			unsigned char DTIE : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char DTIE : 1;
			unsigned char ESIE : 1;
			unsigned char RPTIE : 1;
			unsigned char SARIE : 1;
			unsigned char DARIE : 1;
#endif
	} BIT;
	} EDMINT;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long DARA : 5;
			unsigned long  : 1;
			unsigned long DM : 2;
			unsigned long SARA : 5;
			unsigned long  : 1;
			unsigned long SM : 2;
			unsigned long DIR : 1;
			unsigned long AMS : 1;
			unsigned long  : 14;
#else
			unsigned long  : 14;
			unsigned long AMS : 1;
			unsigned long DIR : 1;
			unsigned long SM : 2;
			unsigned long  : 1;
			unsigned long SARA : 5;
			unsigned long DM : 2;
			unsigned long  : 1;
			unsigned long DARA : 5;
#endif
	} BIT;
	} EDMAMD;
	unsigned long  EDMOFR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DTE : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char DTE : 1;
#endif
	} BIT;
	} EDMCNT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SWREQ : 1;
			unsigned char  : 3;
			unsigned char CLRS : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char CLRS : 1;
			unsigned char  : 3;
			unsigned char SWREQ : 1;
#endif
	} BIT;
	} EDMREQ;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ESIF : 1;
			unsigned char  : 3;
			unsigned char DTIF : 1;
			unsigned char  : 2;
			unsigned char ACT : 1;
#else
			unsigned char ACT : 1;
			unsigned char  : 2;
			unsigned char DTIF : 1;
			unsigned char  : 3;
			unsigned char ESIF : 1;
#endif
	} BIT;
	} EDMSTS;
	char           wk1[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DREQS : 2;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char DREQS : 2;
#endif
	} BIT;
	} EDMRMD;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char EREQ : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char EREQ : 1;
#endif
	} BIT;
	} EDMERF;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PREQ : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char PREQ : 1;
#endif
	} BIT;
	} EDMPRF;
} st_exdmac0_t;

